from collections import defaultdict# از این استفاده میکنیم تا یه دیکشنری *خالی* تعریف کنیم که مقدار کلید هاش فقط عدد باشن
# گرفتن تعداد بازی ها
n = int(input())
input()             # یعنی اولین خطی که به عنوان ورودی میده رو بیخیال شو (همون سر تیتر هایی که ما لازمشون نداریم) 
                    # حواستون باشه توی این تمرین همیشه داده های ورودی ما به یه ترتیب خاصی ان
                    # مثلا همیشه اول تاریخ بازیه بعد اسم تیم میزبان و ...
                    # اگه به ترتیب نبود باید خط اول رو هم میگرفتیم و اون رو اساس قرار میدادیم
# بعدا به اینا نیاز داریم
data= []
comeBacks = defaultdict(int)# تعریف دیکشنری خالی

# دریافت اطلاعات بازی ها
for i in range(n):
    data.append(input().split(',')) # تبدیل رشته ها به لیست
 
for j in data:
    homeTeam = j[1] # تیم میزبان
    awayTeam = j[2] # مهمان

    tmp = j[8] # نتیجه نیمه اول

    if tmp == 'D': # اگه نتیجه نیمه اول مساوی بود حلقه رو از اول اجرا کن
        continue
    
    # مقایسه نتیجه نیمه اول با نتیجه نهایی
    # اگر تفاوت داشت به عنوان کام بک در نظر میگیریم
    if j[5] != tmp:
        if tmp == 'A':
            comeBacks[homeTeam] += 1
        else:
            comeBacks[awayTeam] += 1

print(max(comeBacks, key=comeBacks.get))# از توی دیکشنری، کلید با بیشترین مقدار را (تیم با بیشترین کام بک) برگردان